#language: ru

  Функционал: Я как админ, хочу создавать посты, от имени зареганных пользователей.

    @logadmin
    Сценарий: создание поста админом от имени зарегистрированного пользователя.
      И кликаю на ссылку "Posts"
      И кликаю на ссылку "New Post"
      И выбираю "Волонтеры" в поле "Organization"
      И выбираю "User_5" в поле "User"
      И выбираю "Благодарность" в поле "Post category"
      И ввожу в поле "Title" текст "Админ создал эту тему от имени юзера"
      И ввожу в поле "Body" текст "Этот тест написал Максим"
      И кликаю на кнопку "Create Post"
      И должен увидеть текст "Post was successfully created"
      Допустим я на странице "/posts"
      И должен увидеть текст "Админ создал эту тему от имени юзера"