#language: ru

  Функционал: Я как админ, хочу создавать посты, от имени зареганных пользователей.

    @logadmin
    Сценарий: создание поста админом от имени зарегистрированного пользователя.
      Допустим я на странице админ публикации "/admin/posts"
#      И кликаю на ссылку "Публикация"
      И кликаю на ссылку "Создать Публикация"
      И выбираю из списка "Волонтеры" в поле "Organization"
      И выбираю из списка "User_5" в поле "User"
      И выбираю из списка "Благодарность" в поле "Категория публикации"
      И ввожу в поле "Тема" текст "Админ создал эту тему от имени юзера"
      И ввожу в поле "Текст" текст "Этот тест написал Максим"
      И кликаю на кнопку "Create Публикация"
#      И должен увидеть текст "Post was successfully created"
      Допустим я на странице "/posts"
      И должен увидеть текст "Админ создал эту тему от имени юзера"


#    @login @logout
#    Сценарий: Создание поста, редактирование и удаление.
#      Допустим я на странице создания поста
#      И ввожу в поле "Title" текст "Тестовый заголовок"
#      И выбираю из списка "Нужна помощь" в поле "post_post_category_id"
#      И ввожу в поле ckeditor "Body" текст "Тестовый текст поста"
#      И кликаю на кнопку "Publish"
#      Тогда должен увидеть текст "Your have created post!"
#      И кликаю на ссылку "Edit"
#      И ввожу в поле "Title" текст "Тестовый заголовок2"
#      И выбираю из списка "Благодарность" в поле "post_post_category_id"
#      И ввожу в поле ckeditor "Body" текст "Тестовый текст поста2"
#      И кликаю на кнопку "Publish"
##      Тогда должен увидеть текст "Тестовый заголовок2"
#      И кликаю на ссылку "Delete"
#      И кликаю на алерт "Ок"
#      Тогда должен увидеть текст "Post deleted!"
#      Допустим перехожу "/posts"
#      И должен не найти "Текстовый заголовок2"