#language: ru

Функционал: Авторизация пользователя

  Сценарий: Вход с систему с правильным паролем
    Допустим я на странице "/users/sign_in"
    Когда ввожу "user2@example.com" в поле "Email"
    И ввожу "123456" в поле "Password"
    И кликаю на кнопку "Log in"
    И должен увидеть текст "Добро пожаловать"

  Сценарий: Регистрация нового пользователя
    Допустим я на странице "/users/sign_up"
    Когда ввожу "Olga" в поле "Name"
    И ввожу "0-700-14-12-15" в поле "Phone"
    И ввожу "olga@example.com" в поле "Email"
    И ввожу "123456" в поле "Password"
    И ввожу "123456" в поле "Password confirmation"
    И должен увидеть текст "Добро пожаловать"