#language: ru

Функционал: Регистрация Организации
  @login
  Сценарий: Регистрация новой организации
    Допустим я на странице юзера "/organizations/new"
    И выбираю из списка "Детский дом" в поле "Organization category"
    И ввожу в поле "Name" текст "Детский Дом Максима"
    И выбираю из списка "Баткенская область" в поле "Oblast"
#    И ввожу в поле "Longitude" текст "85.4"
#    И ввожу в поле "Latitude" текст "90.6"
    И ввожу в поле "Location" текст "asfdasdf"
    И ввожу в поле "Address" текст "asdf"
    И ввожу в поле "Contact person" текст "фывафыавфавы"
    И ввожу в поле "Phone" текст "558126394"
    И кликаю на кнопку "Create Organization"
    И должен увидеть текст "your organization create request sent to admin"

  @logadmin
  Сценарий: Активация Организации
    Допустим я на странице админ "/admin/organizations"
    И кликаю через xpath1 "Изменить" для "organization_9"
    И выбираю в радио батон "Yes" в поле "статус"
    И кликаю на кнопку "Update Организация"
#    И должен увидеть текст "Organization was successfully updated"

   @login
   Сценарий: Проверка наличия организации в списке
     Допустим перехожу на "/organizations/list"
     И должен увидеть текст "Детский Дом Максима"

     @logadmin
   Сценарий: Деактивация организации.
     Допустим я на странице админ "/admin/organizations"
     И кликаю через xpath1 "Изменить" для "organization_9"
     И выбираю в радио батон "No" в поле "статус"
     И кликаю на кнопку "Update Организация"
     И перехожу на "/organizations/list"
     И должен не найти "Детский Дом Максима"