# language: ru

  Функционал: Создание поста авторизованным пользователем
    Я как пользователь
    Хочу создавать посты
    Чтобы предоставлять своевременно информацию от имени организации

  @login @logout
  Сценарий: Создание поста
    Допустим я на странице создания поста
    Когда ввожу "Тестовый заголовок" в поле "Title"
    И выбираю "Нужна помощь" в поле "post_post_category_id"
    И ввожу "Тестовый текст поста" в поле "Body"
    И кликаю на кнопку "Опубликовать"
    Тогда должен увидеть текст "Текстовый заголовок"

