# language: ru

  Функционал: Создание поста авторизованным пользователем
    Я как пользователь
    Хочу создавать посты
    Чтобы предоставлять своевременно информацию от имени организации

  @login @logout
  Сценарий: Создание поста
    Допустим я на странице создания поста
    И ввожу в поле "Title" текст "Тестовый заголовок"
    И выбираю "Нужна помощь" в поле "post_post_category_id"
    И ввожу в поле "Body" текст "Тестовый текст поста"
    И кликаю на кнопку "Опубликовать"
    Тогда должен увидеть текст "Текстовый заголовок"

