# This file should contain all the record creation needed to seed the database with its default values.
# The data can then be loaded with the rails db:seed command (or created alongside the database with db:setup).
#
# Examples:
#
#   movies = Movie.create([{ name: 'Star Wars' }, { name: 'Lord of the Rings' }])
#   Character.create(name: 'Luke', movie: movies.first)
require 'ffaker'

AdminUser.create!(email: 'admin@example.com', password: '123456', password_confirmation: '123456')

user1 = User.create!(name: FFaker::NameRU.name, phone: '0-700-62-00-00', email: 'user1@example.com', password: '123456', password_confirmation: '123456')
user2 = User.create!(name: FFaker::NameRU.name, phone: '0-555-67-12-14', email: 'user2@example.com', password: '123456', password_confirmation: '123456')
user3 = User.create!(name: FFaker::NameRU.name, phone: '0-777-68-10-00', email: 'user3@example.com', password: '123456', password_confirmation: '123456')
user4 = User.create!(name: FFaker::NameRU.name, phone: '0-556-63-12-14', email: 'user4@example.com', password: '123456', password_confirmation: '123456')
user5 = User.create!(name: FFaker::NameRU.name, phone: '0-556-19-00-10', email: 'user5@example.com', password: '123456', password_confirmation: '123456')

users = User.all

about = About.create!(description: 'Эта страничка О нас. Она создается из админки.')

organization_category_1 = OrganizationCategory.create!(   
  name: 'Активисты', 
  description: 'Волонтеры, неравнодушные, активные жители',
  active: true    
)
organization_category_2= OrganizationCategory.create!(   
  name: 'Детский дом', 
  description: 'Детскиое учреждение',
  active: true    
)
organization_category_3 = OrganizationCategory.create!(   
  name: 'Дом престарелых', 
  description: 'Организация по уходу за пожилыми людьми',
  active: true    
)
organization_category_4 = OrganizationCategory.create!(
    name: 'Доноры',
    description: 'Организации и компании, предоставляющие помощь',
    active: true
)

oblast_1 = Oblast.create!(
  name: 'г. Бишкек'
)
oblast_2 = Oblast.create!(
  name: 'г. Ош'
)
oblast_3 = Oblast.create!(
  name: 'Баткенская область'
)
oblast_4 = Oblast.create!(
  name: 'Джалал-Абадская область'
)
oblast_5 = Oblast.create!(
  name: 'Иссык-Кульская область'
)
oblast_6 = Oblast.create!(
  name: 'Нарынская область'
)
oblast_7 = Oblast.create!(
  name: 'Ошская область'
)
oblast_8 = Oblast.create!(
  name: 'Таласская область'
)
oblast_9 = Oblast.create!(
  name: 'Чуйская область'
)

organizations = Organization.create!([
  {
    name: 'Волонтеры',
    oblast_id: oblast_1.id,
    location: 'г. Бишкек',
    address: 'Кыргызстан, Чуйская область, г. Бишкек',
    phone: '+996 (3134) 33172',
    organization_category_id: organization_category_1.id,
    active: true,
    latitude: '42.87596410238256',
    longitude: '74.54360961914062'
  },
  {
    name: 'Военно-Антоновский детский дом',
    oblast_id: oblast_9.id,
    location: 'с. Военно-Антоновка',
    address: 'Кыргызстан, Чуйская область, Сокулукский район, с. Военно-Антоновка, ул. Фрунзе, 118',
    phone: '+996 (3134) 33172',
    organization_category_id: organization_category_2.id,
    url: 'www.v-adetdom.kg',
    active: true,
    latitude: '42.9008671451945',
    longitude: '74.64300155639648'
  },
  {
    name: 'Ак-Суйский детский дом',
    oblast_id: oblast_5.id,
    location: 'с. Теплоключенка',
    address: 'Кыргызстан, Иссык-Кульская область, Ак-Суйский район, с. Теплоключенка, ул. Ленина, 152',
    phone: '+996 (3948) 91109',
    organization_category_id: organization_category_2.id,
    url: '',
    active: true,
    latitude: '42.91155476081381',
    longitude: '74.59613800048828'
  },
  {
    name: 'Бишкекский городской дом-интернат общего типа для престарелых',
    oblast_id: oblast_9.id,
    location: 'г. Бишкек',
    address: 'Кыргызстан, Чуйская область, Первомайский район, г. Бишкек, ул. Абая, 57',
    phone: '+996 (312) 540305',
    organization_category_id: organization_category_3.id,
    url: ' www.dominter.biz',
    active: true,
    latitude: '42.86413792617463',
    longitude: '74.58824157714844'
  },
  {
    name: 'Дом-интернат для пожилых людей Ленинского района мэрии г. Бишкек',
    oblast_id: oblast_9.id,
    location: 'г. Бишкек',
    address: 'Кыргызстан, Чуйская область, Ленинский район, г. Бишкек, ул. Интергельпо, 8',
    phone: '+996 (312) 653711',
    organization_category_id: organization_category_3.id,
    url: '',
    active: true,
    latitude: '42.850799307092515',
    longitude: '74.6407699584961'
  },
  {
    name: 'Орловский детский дом',
    oblast_id: oblast_9.id,
    location: 'пгт. Орловка',
    address: 'Кыргызстан, Чуйская область, Кеминский район, пгт. Орловка, ул. Победы, 16',
    phone: '+996 (3137) 23459',
    organization_category_id: organization_category_2.id,
    url: '',
    active: true,
    latitude: '42.124115125125',
    longitude: '75.1241215125'
  },
  {
    name: 'Специализированный дом ребёнка (СДР)',
    oblast_id: oblast_9.id,
    location: 'г. Бишкек',
    address: 'Кыргызстан, Чуйская область, Октябрьский район, г. Бишкек, ул. Белорусская, 121',
    phone: '+996 (3138) 62971',
    organization_category_id: organization_category_2.id,
    url: '',
    active: true,
    latitude: '42.835947266683796',
    longitude: '74.60609436035156'
  },
  {
    name: 'Rotary club',
    oblast_id: oblast_9.id,
    location: 'г. Бишкек',
    address: 'Кыргызстан, Чуйская область, Октябрьский район, г. Бишкек, ул. Солнечная, 121',
    phone: '+996(312)345678',
    organization_category_id: organization_category_4.id,
    url: '',
    active: true,
    latitude: '42.435947266683796',
    longitude: '74.20609436035156'
  }
])

UserOrganization.create!([
  {
    user_id: user1.id,
    organization_id: organizations[0].id,
    role: 2
  },
  {
    user_id: user2.id,
    organization_id: organizations[0].id,
    role: 2
  },
  {
    user_id: user3.id,
    organization_id: organizations[0].id,
    role: 2
  },
  {
    user_id: user4.id,
    organization_id: organizations[0].id,
    role: 2
  },
  {
    user_id: user5.id,
    organization_id: organizations[0].id,
    role: 2
  },
  {
    user_id: user1.id,
    organization_id: organizations[2].id,
    role: 1
  },
  {
    user_id: user1.id,
    organization_id: organizations[3].id,
    role: 1
  },
  {
    user_id: user1.id,
    organization_id: organizations[5].id,
    role: 2
  },
  {
    user_id: user2.id,
    organization_id: organizations[3].id,
    role: 2
  },
  {
    user_id: user2.id,
    organization_id: organizations[5].id,
    role: 1
  }
])
user_organizations = UserOrganization.all

PostCategory.create!([
  {
      name: "Нужна помощь"
  },
  {
      name: "Фото отчет"
  },
  {
      name: "Делимся радостью"
  },
  {
      name: "Благодарность"
  },
  {
      name: "Отдам даром"
  }
])
post_categories = PostCategory.all

posts_data = [
    {
        title: 'нужна помощь женщине с 2-умя детьми,сбежала от мужа, нужны вещи и продукты',
        body: "Есть семья,которую мы поддерживали в течении полутора лет,но сейчас у самих небольшие трудности и я обращаюсь к вам!
              \n немного о семье:

              \n Мама и двое детей(девочка 12 лет,мальчик 6лет) не так давно ушла от мужа и сейчас воспитывает одна...
              \n В данное время работает, снимает квартиру, но зарплаты хватает только на аренду, не говоря уже о ком. услугах. Подрабатывает вязанием детских шапочек и уроками вязания(так удалось накопить на зимнюю одежду для детей),но это все не постоянно и в последнее время вообще не было заказов......
              \n Старается чтоб детки выглядели не хуже других,хорошо и опрятно одеты,чтоб не чуствовали себя некомфортно среди сверстников...старшая ходит в школу, мальчик с сентября пойдет в первый класс

              \n Сейчас детки подросли,а денег купить необходимые вещи нет и не предвидится т.к. за зиму накопился долг за ком. услуги ,потому что стоял выбор либо продуктов купить,либо оплатить счета.....

              \n Сейчас очень срочно нужны вещи на весну и лето,а вообще на все сезоны

              \n мальчик: рост 117-120, размер ноги 31-32(18см), от пояса до пола 64см
              \n вещи,то что необходимо- ботасы, сандали, джинсы, шорты, кофты,футболки и т.п(можно и на вырост)
              \n с сентября понадобиться костюм в школу и туфли, зимняя куртка и штаны

              \n Девочка: рост 150см,размер 42-44,размер ноги 35
              \n Вещи любые,обувь...

              \n так же нужно пастельное белье и мыломойка...

              \n Если кто-то сможет помочь продуктами,семья будет очень благодарна!",
        post_category: post_categories.first,
        organization: user_organizations.first.organization,
        user: user_organizations.first.user
    },
    {
        title: 'Семья в беде! Требуется финансовая поддержка, Четверо детей 3-13 лет.',
        body: 'Доброго времени суток! Хочу рассказать вам историю одной семьи, о которой узнала случайно.
              Мамбетжакыпова Жазгул мать четырёх детей оказалась в тяжелой ситуации. Весной этого года самому младшему ребёнку и единственному сыну Мустафе поставили страшный диагноз - лейкоз Беркита (рак крови). Ради сына Жазгул пришлось оставить в родном городе Балыкчи мужа и троих дочерей и вот уже с апреля мать с сыном живут и борются с болезнью в республиканской онкологии. Трехлетний Мустафа переодически проходит курс дорогостоящей химиотерапии, стоимость одной 15000сом.
              В Бишкеке у них никого нет.
              Муж работает разнорабочим, смотрит за тремя дочерями. Старшая ходит в восьмой класс, средняя в 6 а младшая в 3. Все школьницы.
              Вчера ездили навещать мать с сыном в онкологию, женщина очень порядочная, набожная. Просить помощи ей стыдно, если бы мы не узнали о её истории, выхода к общественности они бы так и не нашли.
              Семье нужна помощь. Даже купить канцтовары дочерям у них нет возможности.
              Сегодня мы открыли ей электронный кошелёк ЭЛСОМ на номер матери Мамбетжакыповой Жазгул 0702313307 у кого есть возможность и желание помочь даже 20сом будут очень полезными для этой семьи.
              Каждый из вас может их навестить, лежат в они в онкологии в девятом детском отделении рядом с момологией, и убедиться что мама очень порядочная женщина, готовая сделать все ради своего ребёнка. Позже я скину документы ребёнка с диагнозом.
              С миру по нитке! Дорогие друзья, мы можем им помочь, не остантесь равнодушными!
              Если будут возникать вопросы, можете звонить мне 0700099903 (Мадина), так как мама Мустафы не всегда может подойти к телефону. ',
        post_category: post_categories.first,
        organization: user_organizations.last.organization,
        user: user_organizations.last.user
    },
    {
        title: 'Уважаемые автолюбители! Иногда без вашей помощи не обойтись...',
        body: 'Ребят, у кого есть желание и возможность иногда помогать в работе раздела "Благотворительность", пожалуйста, оставьте в этой теме свои данные.
              Какие будут просьбы:
              - забрать-отвезти на пункт сбора или по адресу переданные вещи;
              - навестить подопечных в компании с участником раздела;
              - поехать на закуп продуктов или вещей для нуждающихся;
              - съездить за медикаментами;
              - поучаствовать в акциях (поездка в дет.дома, дома престарелых и т.п.);
              - встретить/отвезти на вокзал или в аэропорт наших подопечных или лекарственные средства;
              - и т.д.

              Иногда есть возможность перенести поездку на вечер рабочего дня или выходные. Но часто бывает необходимость СРОЧНО закупить и отвезти лекарства (например, в ожоговое). Поэтому, если у вас есть возможность и вы готовы "сорваться" среди дня на час-два - отметьте это, пожалуйста.

              Не забудьте указать способ связи.

              Мой тел. 0552 217 217

              СПАСИБО! ',
        post_category: post_categories.first,
        organization: user_organizations[2].organization,
        user: user_organizations[2].user
    },
    {
        title: 'помогу пенсионерам колоть дрова',
        body: 'если вы уже в возрасте и здоровье вам не позволяет нарубить дрова для дома, то я бы хотел вам помочь.
              опыт у меня в этом большой, так что обращайтесь.
              уважаемые читатели темы, пожалуйста подумайте о тех пенсионерах, которые живут рядом с вами.
              я больше чем уверен что у них нет возможности пользоваться дизелем, а вы пользуетесь и читали эту тему,
              так предложите им мою помощь.
              И было бы просто здорово если вы тоже пойдете со мной.
              для меня это будет подмога, а для вас возможность наладить взаимоотношения с вашими соседями,
              которым мы можем вместе помочь.
              пишите в личку или звоните 0779 450 350 или whatsapp ',
        post_category: post_categories[4],
        organization: user_organizations[2].organization,
        user: user_organizations[2].user

    },
    {
        title: 'Отдам даром, Детскую кроватку и коляску.',
        body: 'тдам нуждающимся детскую кроватку ( новая) в разобраном виде и люлька. Коляску б/у и немного игрушек
              Пожалуйста, только тем кому действительно нужно, а не ушлым халявщикам ',
        post_category: post_categories[4],
        organization: user_organizations.first.organization,
        user: user_organizations.first.user
    },
    {
        title: 'даром книги, Для студентов юр факультета',
        body: 'Книги разные для студентов юридического факультета, только нуждающиемся. При наличии аттестата ударника или отличника - можете забрать бесплатно😊. Самовывоз . 0550771717 Эльвира. ',
        post_category: post_categories[4],
        organization: user_organizations[1].organization,
        user: user_organizations[1].user
    },
    {
        title: 'Отдам в детский дом даром вещи для девочки до 1,5 года.',
        body: 'Вещи, игрушки, прикроватные бортики, теплые комбинезоны. Напишите где пункты приема привезем. тел. 0 555 905 929.',
        post_category: post_categories[4],
        organization: user_organizations[2].organization,
        user: user_organizations[2].user
    },
    {
        title: 'Индийский учебный центр при поддержке Посольства Индии предлагает безвозмездные занятия Сахаджа йога, Английский, Хинди, йога для беременных, йогатерапия, йога в офисах',
        body: 'Мир Вам!
                Индийский учебный центр при поддержке Посольства Индии проводит занятия на безвозмездной основе:
                Вход свободный на все курсы для всех желающих!
                Сахаджа Йога
                Понедельник, с 9:00 до 11:00
                Вторник, Четверг с 9:00 до 13:00 Национальная библиотека, 2 этаж, Индийский учебный центр

                На занятиях:
                лекции о йоге, упражнения (ассаны), медитация.
                Если есть личный коврик для занятий йогой, то приносите, если нет мы выдадим.
                Форма одежды любая
                Вечерние занятия Сахаджа йогой
                Понедельник, среда, с 18:00 до 20:00 муз училище им. Куренкеева, 2 этаж, 30 кабинет (Пересечение Московской и Панфилова)
                На вечерних занятиях лекция о йоге, о чакрах и медитация. Вопросы по вечерним занятия йогой по телефону 0 550 42 46 76

                Английский для начинающих
                Понедельник, Пятница - с 13:00 до 14:00

                Хинди
                Понедельник, Пятница - с 14:10 до 15:10
                преподаватель - супруга посла Индии г-жа Прия Джаянт

                Английский для продолжающих
                Понедельник, Пятница - с 15:30 до 16:30
                преподаватель - супруга посла Индии г-жа Прия Джаянт

                Индийский классический танец катхак
                Вторник, Четверг 14:00 - 15:00

                При себе иметь тетрадь для записей и ручку.
                Занятия проводятся для всех желающих не зависимо от возраста, национальности и вероисповедания.
                Наш адрес: Национальная Библиотека
                2 этаж, ул. Абдрахманова 208
                при себе иметь: паспорт, фото 3Х4
                и 40 сом для оформления читательского билета на 1 год ,
                Приходите, получайте знания. Рады будем видеть Вас!

                Организовываем семинары по йоге в офисах, учебных заведениях, коллективах БЕЗВОЗМЕЗДНО!
                Все вопросы по телефону:
                0 556 60 15 13, 0 776 60 15 13 ',
        post_category: post_categories[4],
        organization: user_organizations[2].organization,
        user: user_organizations[2].user
    },
    {
      title: 'Томские врачи и РусФонд пришли на помощь!, Болотов Нуразим и Калыбеков Калысбек летят на операцию!',
      body: 'Еще летом, по просьбе наших врачей, мы отправляли документы двух малышей с очень сложными пороками сердца в Томск для консультации.
              Все это время шла переписка и переговоры с томскими кардиохирургами и и Русфондом. Огромное спасибо Виктории - tomsk за хлопоты и вот наконец-то пришел ответ - томичи берут наших малышей на операции, и эти операции оплачивает РусФонд!
              Я не знаю, кому конкретно говорить спасибо в РусФонде...
              Спасибо всем сотрудникам Русфонда и всем-всем россиянам, которые перечисляют помощь, персональное спасибо томичам - Виктории и врачам...
              Надеемся, что операцию пройдут отлично и наши малыши вернутся домой здоровыми!

              Сейчас выкладываю документы малышей. Семьи малоимущие, на операции сами они никогда бы не собрали.
              Сейчас они собирают документы для выезда и сдают анализы.

              На билеты они стараются собрать сами, но мы, на всякий случай открыли тему, чтобы подстраховаться, если вдруг у них не получится собрать.

              Прием в клинике намечен на 14 октября 2013 года.
              Вылет тоже намечен на 14.10.2013. рано утром. Заявления мы уже отнесли в авиакомпанию, надеемся на Медера.kg.

              Итак...
              1. Болотов Нуразим 07.01.2012. года рождения.
              Многодетная семья из с.Курбу Ак-Суйского района. В семье пятеро детей.',
      post_category: post_categories[3],
      organization: user_organizations[5].organization,
      user: user_organizations[5].user
    },
    {
        title: 'Благотворительная фотовыставка для женщин из фонда "Халиллуя", Будем рады, если кто-то захочет принять участие!',
        body: 'Добрый день!

              Я думаю многие вспомнят фотовыставку "Мечты сбываются" для девушек с физическими ограничениями, организатором которой являлась я - ваша Мещерякова Юлия.

              В этом году будет повторное мероприятие с моральной поддержкой Евсеевой Ольги - директором благотворительного фонда "Халиллуя", на территории которого проходили фотосъемки.

              В этом году принимают участие безвозмездно:
              Визажист - Алиса Быкова
              Парикмахер - Кристина Чернова
              Фотографы - Галина Комиссарова, Лида Явгет, Валентина Кондакова.
              Все профессионалы высшего класса.

              Наряды предоставила, подбирала и помогала на протяжении всех фотосъемок Алена Ощепкова. Так же, некоторые наряды предоставила Дарья Идоятова.

              Очень скоро Вы увидите очень красивых женщин и очень красивые работы (фотографии) на выставке. Завтра уже будет проведена последняя фотосессия. Среди наших моделей девушки и женщины из фонда "Халиллуя". Наши красавицы из малоимущих семей, некоторые выросли даже в детском доме. Среди них есть так же женщины с физическими ограничениями.

              Очень хочется показать нашему обществу, что нельзя делить людей по материальному статусу и что физические ограничения - не приговор. А еще сильнее хочется, чтобы наши модели увидели себя с другой стороны - красивыми, женственными - и наконец-то поверили в себя!

              На данный момент нужна благотворительная помощь от фотосалона: кто сможет распечатать бесплатно фотографии для данной фотовыставки? 50 фотографий, формат листа А4.

              Хочу подчеркнуть, что помощь требуется не материальная (не хочу брать на себя материальную ответственность), а именно действиями.

              Так же, можете найти меня на сайте odnoklassniki.ru Мещерякова Юлия 26 лет

              Уважаемые модераторы, если вдруг я создала тему ни в том разделе, простите пожалуйста. И перенесите ее, пожалуйста, в нужный раздел. ',
        post_category: post_categories.first,
        organization: user_organizations[2].organization,
        user: user_organizations[2].user
    },
    {
        title: 'Наша помощь "Скорой помощи", Эти люди всегда едут к нам на помощь, Пришло время помочь и нам.',
        body: 'Огромное количество просмотров говорит о небезразличии горожан к событиям освещенным в теме:
              http://diesel.elcat.kg/index.php?showtopic...t=0&start=0

              Многие оставили свои гневные комменты. Но я хочу рассказать об этом немного по-другому. Я знаю эту бригаду (07) и машину. У меня мама сильно болеет, сердечница. Они к ней много раз приезжали. Сейчас складывается удручающая ситуация. Машина стоит разбитая на штрафной стоянке городского ГАИ и "скорую" за эту стоянку еще заставляют платить!!! Машина обслуживала 12-14 вызовов в сутки, причем надо понимать, на какой вызов едет кардиологическая реанимация - вытаскивать с того света. Ментяришка, участник аварии, назовем его пока так, - пытается отмазаться. Вы понимаете, человек, запустивший страшный счетчик чьих-то жизней - считает возможным просто не появляться у следователя ГАИ. Я не представляю ход мыслей этого человека! Знать, что из-за тебя в любую минуту может умереть, И УМИРАЕТ!!!, человек, и тратить это время на поиски путей "отмазки"! Я не понимаю его начальника и сослуживцев, которые либо просто наблюдают за происходящим, либо принимают участие в "судьбе героя" помогая ему избежать правосудия. Они думают что, их родственники или даже они сами (инфаркт сильно "помолодел" - 40 летние давно не удивляют врачей) заколдованные??? А если именно к ним не успеет одна из двух оставшихся машин? Они первые обвинят "скорую" что ехала долго!!!! Я не понимаю родителей Улана, скоро же все узнают что именно их сын - "ангел смерти", это же невозможно спрятать! Как они в глаза то людям смотреть будут?

              Для себя я принял решение. Я обычный житель города, но я не могу в сложившийся ситуации сидеть просто так. Я прошу всех, кто читает эту тему понять, - пока вы ее читаете на какую-то семью в этом городе обрушивается страшная беда, - смерть близкого. Я не хочу сидеть и дожидаться своей очереди. Я решил помочь в этой ситуации людям, чьи жизни зависят от 103. Чем больше машина стоит - тем больше людей умрет. Вот такая зависимость. Понятно, что суд будет по-любому, я общался с Главным врачем ССМП Гульнарой Ташибековой, она настроена очень решительно. Деятельная женщина, врач, имеющий настоящий авторитет в медицинских кругах, делает все от нее зависящее. Написала письмо Президенту, Прокурору КР, подняла общественность. Большое спасибо Депутату Дастану Бекешеву, который помимо запросов, направленных в правоохранительные органы и Прокуратуру, выделил личные денежные средства на работу адвокатов. Но их работа будет продолжаться не один месяц. Суд по ДТП может идти несколько лет. Понятно что когда-нибудь Улана Садыкова суд обяжет возместить ущерб, если у него не хватит совести сделать это самому. Но все это время реанимобиль будет стоять разбитый и разваливаться, все это время будут умирать чьи-то родные. Да и возмещенные деньги "скорая", с ее скромным бюджетом, всегда найдет как потратить с толком, опять же на нас с вами.

              Я сегодня ездил осматривал машину, возил своего друга маляра и костоправа. Повреждения очень серьезные. Задеты силовые элементы кузова спереди и с боку. Ну там по фото видно. Только малярные работы и "костоправка" будет стоить около 2500 долларов. Но еще необходимы некоторые запчасти. Например передняя фара стоит около 700 долларов, потребуется новое крыло и бампер, остальное можно попробовать выправить. Неизвестно, насколько задеты агрегаты и двигатель. Сколько может понадобиться на прочие неожиданности, которые, обязательно возникнут во время такого серьезного ремонта - тоже большой вопрос. Так же надо помнить про врачей, пострадавших при аварии, кроме больничного листа и участия коллег им помочь никто из друзей и начальников бравого опера не торопиться.

              Понятно, что сумма ремонта будет огромна. Возможно у кого-то есть силы и желание помочь деньгами, возможно кто-то поможет в приобретении запчастей для ремонта, кто-то может помочь в их поиске и доставке, кто-то реализует автокраски и необходимые компоненты и может продать их со скидкой... Давайте возьмемся и поможем все вместе! Мы все живем в этом городе, мы все зависим от 103. Эти люди в любое время года и дня или ночи спешат нам на помощь несмотря ни на что. Давайте и мы поможем им, давайте поспешим! Я верю, что в нашем городе живут не только "опера садыковы", но и нормальные люди, готовые с открытой душой прийти на помощь когда она стала нужна.

              Раздел "Благотворительность" закрыт. Да и не знаю, насколько эта тема уместна там. Возможно организовать какую-то инициативную группу для координации. Возможно кто-то располагает возможностью распространить ссылки на эту тему на других ресурсах. Я готов принять участие во всех мероприятиях. Имею прямые контакты с Главным врачем ССМП Гульнарой Ташибековой и адвокатами. Приму участие (и материальное) в малярных работах и восстановлении спецокраски на машине.

              Прошу всех модераторов и супермодераторов с пониманием отнестись к моей теме, и разместить ссылки на нее в своих разделах. Например по ремонту авто и других коммерческих. Прошу жестко модерировать, а постеров - воздержаться от офф-топа и ненужного трепа. Только конкретные предложения.

              Прошу всех, имеющих отношение к "ДизельЛюдям" вспомнить, как мы много сделали вместе в сложное революционное время. Давайте обьединимся сейчас опять, давайте опять сделаем большое, доброе и полезное дело

              http://diesel.elcat.kg/index.php?showtopic=22572737

              С понедельника на Станции Скорой Помощи. Исанова 105.Через кассу, чтобы все было официально оформлено как приходники.

              пункт приема помощи для оплаты

              Вы можете передать деньги через "точки сбора денег" раздела Благотворительность

              1. пр.Манаса 9 (Кофейня Сoffee между Моск. и Боконбаева) - 0555 58 76 44 (прямой) Зуля (Paramaribo)
              2. ул.Т.Молдо- Дворец Спорта (Кофейня Сoffee) - 0555 58 76 44 (прямой) Зуля (Paramaribo)
              3. р-н ЦУМа, Киевская/Шопокова (Кофейня Сoffee) - 0555 58 76 44 (прямой) Зуля (Paramaribo)
              Кофейни работают ежедневно с 9 до 24 часов, все работники кофеен в курсе - помощь можно приносить в любое время - пароль "Дизель"
              4. мкр "Джал" - 0555 923 565 Надежда (sanje)
              5. "1000 мелочей", вход с угла Чуй/Гоголя, отдел "Мылашка" - 0515 79 48 56 Настя (primavera)
              6. р-н Политех, Ахунбаева/Душанбинская - 0555 82 51 55 Ольга (Oka)
              7. 0555 951311 Назгуля (Nazya)
              8. мкр "Аламедин-1" - 0552 217 217 Наталья (sunnata)
              9. К.Акиева/Токтогула и Фрунзу/Гоголя - 0555 95 79 84 Юля (Iuka)
              10. рынок Дордой, 1 проход, 48 контейнер. 0555293132 Аля (Ромашка-а)

              На всех точках есть специальные , дизельские тетрадки, куда нужно записать информацию - сумма, кому предназначена и от кого... ',
        post_category: post_categories.first,
        organization: user_organizations[3].organization,
        user: user_organizations[3].user
    },
    {
        title: 'Палыч, который живет сам по себе в гараже, статья написана летом, а ветеран все еще живет в гараже',
        body: 'бездомный фронтовик
                Палыч, который живет сам по себе в гараже

                Ветеран Великой Отечественной войны Михаил ЮРКИН из-за мошенников остался без собственного дома. Пристанище пенсионера — вонючий раскаленный гараж, забитый хламом.
                Назвать Михаила Павловича Юркина, ветерана Великой Отечественной войны, дедом или стариком язык не поворачивается. В свои восемьдесят шесть лет он сорок минут преодолевает пятикилометровую дистанцию, круглый год обливается холодной водой, ведет спартанский образ жизни. Впрочем, такой образ жизни он себе не выбирал, вынудили обстоятельства.
                О беде, в которую угодил Михаил Павлович, нам рассказали автолюбители, гаражи которых находятся в одном из городских кооперативов. От них стало известно, что ветеран Великой Отечественной, попав в лапы мошенников, оказался вышвырнутым из собственного дома и в данный момент проживает в гараже.
                Полученная информация не оставляла выбора — фронтовику необходимо помочь. Разве мыслимо на старости лет очутиться без крыши над головой?! Дорога к пункту назначения пролегала меж добротных особняков, которые уютно расположились на окраине города. Представить трудно, что за стенами этих роскошных домов, покрытых стилизованной черепицей, в достатке живут сытые и довольные люди, а в нескольких метрах ветеран войны влачит жалкое существование в стареньком железном гараже.
                Подъехав к кооперативу, мы хотели было расспросить про Юркина у охранника, контролирующего самодельный шлагбаум. Однако тот, узрев фотокамеру, сразу сообразил: “Вы из газеты? К Палычу? А он вас уже поджидает. Хоть вы помогите нашему марафонцу, а то ведь остался дед без кола, без двора. Разве это справедливо?”.
                Если честно, мы рассчитывали на то, что вот сейчас навстречу выйдет убитый горем, потрепанный жизнью дряхлый старик–фронтовик. И каково же было наше удивление, когда из–за угла домика охранника выбежал сухонький крепенький, шустрый и говорливый Михаил Павлович. В первые минуты знакомства, не скрою, закрались сомнения: наверное, врет про свои трудности, а может, и вовсе сумасшедший.
                — Сколько вам лет? — спрашиваю. — Вы точно в Великую Отечественную воевали?
                — А пойдемте к моему гаражу, — предлагает собеседник. — Там и поговорим.
                Территория кооператива достаточно большая, и чтобы оказаться у теперешнего жилища Михаила Павловича, лучше было бы воспользоваться автомобилем. Однако это предложение фронтовик тут же отмел. Мол, я побегу, а вы за мной поезжайте.
                Мы реально были в шоке, когда Юркин, как заправский марафонец, рванул в сторону своего пристанища. Пришлось прибавить газу, чтобы не потерять ветерана из вида. Естественно, у гаража он оказался раньше нас. И тут мы наконец–то внимательно рассмотрели собеседника.
                Выцветшие глаза, густая паутина разнокалиберных морщин, еще крепкие, но потрясывающиеся руки. Бейсболка, рубаха, брюки — давно не стиранные и явно с чужого плеча. Сердце сжалось. Чтобы не давать воли чувствам, которые могли оскорбить гордого фронтовика, просим отворить ворота гаража. И о ужас!
                Железное пристанище Палыча снизу доверху забито множеством вещей — тряпочки, коробочки, динамики, сломанные стулья и табуретки. А еще кастрюльки и другая кухонная утварь.
                — Как же вы тут живете? Здесь и развернуться негде? — мы неподдельно удивлены.
                — Так я здесь только ночую. А днем брожу по городу и окрестностям. У меня ведь очень много дел, — браво отвечает ветеран Великой Отечественной.
                — А как же вы докатились до жизни такой? — вопрос не то чтобы обижает деда, а в считанные секунды делает уязвимым. Палыч съежился, улетучилась былая бравость, и выглядеть он стал ровно на свои восемьдесят шесть.

                ***

                Жизнь Юркин проживает долгую и тяжелую. Говорит, что не везет ему с рождения. Вот, например, после НЭПа его отца раскулачили, а ему это аукнулось в 1943 году. По дороге на фронт командир части, c которой Юркин собирался бить немца, объявил его врагом народа. Однако принимать в связи с этим кардинальных мер не стал, потому как семнадцатилетний Миша был лучшим стрелком из новобранцев.
                Войну он закончил в Праге. Волею судьбы оказался во Фрунзе. Работал строителем, тогда и получил, как было положено, жилье от предприятия — домик в Сонкульском переулке. Женился, родился сын, развелся. И больше Палыч судьбу браком не испытывал. Выйдя на пенсию, обзавелся пчелиными ульями. К слову, пчелки, по словам фронтовика, вылечили его от серьезного заболевания.
                И без того нерадостная жизнь Юркина пошла под откос три года назад. Вдруг в дом в отсутствии ветерана стали наведываться вандалы. Они то входную дверь порубят топором, то забор разнесут в щепки. Шло целенаправленное запугивание. Кто–то очень ушлый, прознав, что фронтовик одинокий, решил, что жилье почти в центре города для него — непростительная роскошь.
                Михаил Павлович все реже стал появляться дома. Боялся. Однажды почти два месяца пришлось кантоваться у знакомых. А когда решил проведать свое жилье, то ахнул: оно было обнесено новым капитальным забором.
                — А почему в милицию не обратились? — спрашиваю.
                — Соседи мне сказали, что кому–то из милиционеров и приглянулся мой дом. Да еще слухи ходили: в городе орудует банда оборотней в погонах, которые расправляются с одинокими стариками, чтобы завладеть их имуществом. Я сильно испугался, ведь мне тогда было уже 83. Любой молодой мужик со мной в два счета справился бы, — понуро отвечает собеседник.
                Три года пришлось скитаться Палычу по чужим углам. А когда знакомые перестали привечать, он перебрался в гараж, который купил лет десять назад на сэкономленные пенсионные деньги. Все это время он не терял надежды вернуться в собственный дом. Ведь когда убегал, не забыл прихватить документы, подтверждающие, что владелец дома в Сонкульском переулке именно он — Михаил Павлович Юркин. Фронтовик надеялся, что когда–нибудь благодаря инвентаризационной книге он сможет вернуть дом.
                Да не тут–то было. По прошествии нескольких лет, когда ветеран решил в очередной раз навестить свой дом, его жилья на месте не оказалось. За высоким забором красовался двухэтажный особняк, который был уже продан третьм хозяевам.
                ...Палыч не обманывает, у него действительно дел хватает, потому и приходит в свой гараж только переночевать. А днем он без продыха бегает по различным инстанциям. Добивается справедливости. Знакомые подсобили ему с адвокатом, который не берет с деда денег. Однако фронтовик не очень надеется на успех. Но и перспектива прожить остаток жизни в гараже его не устраивает. Вот и барахтается, как та лягушка в стакане с молоком. Получится — выберется из создавшейся ситуации, а нет...
                Выслушав печальную историю Палыча и если честно, не поверив в нее до конца, мы отправились в Сонкульский переулок — хотя бы удостовериться, существует ли адрес, по которому проживал фронтовик Юркин. Действительно, и переулок, и номер дома, и сам дом в два этажа — реально существуют. И чтобы уж совсем расставить все точки над “i” , мы набрали телефон квартальной.
                Женщина подтвердила рассказ Палыча. А услышав, что тот готовится идти в суд, заохала: мол, даже не знаю, как он дом возвращать будет. Его–то жилья уже нет и в помине, а то, что стоит, уже не одного хозяина сменило.

                ***

                Историями о том, что со стариками творят из–за жилплощади, теперь никого не удивишь. И все–таки с каждым новым подобным фактом не перестаешь поражаться наглости и бесчеловечности тех, кто покушается на имущество немощных людей. Хотя с ними ведь проще справиться. Запугал, отобрал... Кто вступится за деда, если даже его сын за все это время пальцем не пошевелил?
                Однако Палыч молодец. Духом не падает. Вот что значит бывший пятиборец. Да почему бывший, если он и сейчас в забегах на пять километров участвует, моржует и верит, что скоро его мытарства закончатся. Это пока он, Палыч, неприкаянный, ходит сам по себе, ищет правды. Но ведь должно же ему когда–нибудь повезти, коль всю жизнь судьба с ним в прятки играла.
                В сентябре фронтовику, проживающему в данный момент на территории гаражного кооператива, стукнет 87. Неужели не найдется ни одного чиновника, который бы защитил честь ветерана Великой Отечественной? А может, стоит попробовать, ведь у всех без исключения впереди только старость. И никто не застрахован от ситуации, в которой сейчас находится Михаил Павлович Юркин.
                Виктория КУРЕНЕВА.
                Фото Темира СЫДЫКБЕКОВА.

                87 человеку стукнуло, а он по прежнему в этом гараже. Сегодня по 5 каналу показали. Дубарина ведь...',
        post_category: post_categories.first,
        organization: user_organizations[4].organization,
        user: user_organizations[4].user
    },
    {
        title: 'Давайте купим бассейн детям с ДЦП со всей Ошской области!, Цена вопроса - 30 тысяч сомов',
        body: 'Люди, помните у нас была тема про Машу и ее дочку Дашу из Нооката? Тогда мама собирала на лечение ребенка в Москве. С тех пор прошло много времени - Маша очень сильно изменилась, стала сильной и реально смотрящей на вещи. Теперь она САМА своему ребенку и мануал и логопет, и физиотерапевт. А еще Маша и такие же, как она мамочки, воспитывающие "особенных" деток, создали неформальный клуб в Оше (она сейчас там живет) - чтобы проще было решать какие-то вопросы, поддерживать друг друга, когда отчаяние захлестывает с головой. Мечта этих мам - купить для их детей каркасный бассейн, который будет стоять в Ошском городском реабилитационном центре (но не будет его собственностью - мало ли как может изметится "настроение" администрации).
              Вот, что мне написала Маша на электронку:

              "...А самое главное и необходимое для наших детей – это различные виды гидротерапии и плавательный бассейн. В нашем городе есть много общественных летних бассейнов, но мы не можем носить туда своих «особенных» деток. Очень велик риск подхватить какой-либо вирус, т.к. у наших детей ослаблена иммунная система, и им нельзя делать прививки. А в воде ребенок легче обучается владению собственным телом. У нас столько хороших методик. Но нет одного - бассейна".

              Маша и девочки уже договорились с администрацией центра о том, что летом бассейн будет стоять на территории центра, а зимой - в самом здании, где под него отведут помещение с сантехнической "подводкой". Естественно, посещение бассейна будет бесплатным, мамы будут скидываться только на "химию" и фильтры для воды.

              В центре лечатся и проходят реабилитацию все детки Южного региона. Давайте поможем им, это ведь самый замечательный подарок на 1 июня!

              Я узнавала на "Джунхае" трехметровый в диаметре бассейн производства Intex стоит 24 тысячи, плюс примерно на 5 тысяч нужно будет взять первоначальный комплект фильтров, "химии" и т.д. Может, кто-то знает места, где можно купить дешевле, пожалуйста, напишите в теме.

              Принести средства на бассейн можно нанаши "точки сбора":

              1. пр.Манаса 9 (Кофейня Сoffee между Моск. и Боконбаева) - 0555 58 76 44 (прямой) Зуля (Paramaribo)
              2. ул.Т.Молдо- Дворец Спорта (Кофейня Сoffee) - 0555 58 76 44 (прямой) Зуля (Paramaribo)
              3. р-н ЦУМа, Киевская/Шопокова (Кофейня Сoffee) - 0555 58 76 44 (прямой) Зуля (Paramaribo)
              Кофейни работают ежедневно с 9 до 24 часов, все работники кофеен в курсе - помощь можно приносить в любое время - пароль "Дизель"
              там есть специальные , дизельские тетрадки, куда нужно записать информацию - сумма, кому предназначена и от кого...
              4. редакция "Вечерки" с 8.00-12.00, и мкр. "Джал" (вечером) - 0555 923 565 Надежда (sanje)
              5. "1000 мелочей", вход с угла Чуй/Гоголя, отдел "Мылашка" - 0515 79 48 56 Настя (primavera)
              6. р-н Политех, Ахунбаева/Душанбинская - 0555 82 51 55 Ольга (Oka)
              7. - 0555 951311 Назгуля (Nazya)
              8. мкр "Аламедин-1" - 0552 217 217 Наталья (sunnata)
              9. - 0555 95 79 84 Юля (Iuka)


              А если получится срешить вопрос с "Мегакомом", то на следующей неделе выделим еще и накопительный номер.

              Люди, спасибо всем заранее! На сайте интернет-редакции "Вечерний Бишкек" тоже создала эту тему, думаю, вместе у нас получится "сбыть" еще одну мечту! ',
        post_category: post_categories.first,
        organization: user_organizations[5].organization,
        user: user_organizations[5].user
    },
    {
        title: 'Помогите старикам, удочерите бабушку!',
        body: 'Нашим старичкам, старше 65 лет, с пенсией ниже 5000 сом, абсолютно одиноким нужна помощь. Удочерите бабушку!!! От вас требуется только финансовая поддержка, абсолютно незначительная - 875 сомов в месяц, это 150 евро в год. Кто хочет, может дать больше. Для кого-то это мелочь, а для них шанс прожить ещё один день!!!

              У нас есть списки бабушек и дедушек, которые остро нуждаются в помощи, некоторые из них спят на голых матрацах, месяцами не видят нормальной еды, питаются картофельными очистками. Порой мороз по коже пробегает.

              Наша организация занимается только пожилыми, вся бухгалтерия прозрачна. Бабушку или дедушку можете выбрать сами, после нашего с вами знакомства вы сами можете вручать денюжку и посещать бабушку, мы вам предоставим анкеты, обязательно познакомим. Всё что связано с коммуникативным процессом, мы берём на себя. Поддержку пожилых, передачу писем, денег, подарков и др., соц. работников предоставляем тоже мы.

              У нас работают замечательные добрые соц. работники, которые не жалеют своих сил ухаживают за бабушками и дедушками. Единственное, у нас не хватает финансов. Если бы каждый взял на себя хоть одну бабушку, ПОВЕРЬТЕ, наш мир действительно стал бы чуточку лучше!

              Бабушки пишут столько благодарственных писем, сочиняют стихи в которых слёзно благодарят за оказанную им помощь и поддержку. Я сама спонсирую одну бабушку. НЕ ПРОЙДИТЕ МИМО! помогите тем, кто строил до вас этот мир.

              Финансово поддержать стариков Вы можете через терминалы "Шмель" (раздел благотворительность, "Babushka Adoption")

              Если у кого-то есть вопросы, предложения, желание физически помочь, звоните, я буду очень рада предоставить любую информацию!
              сот. тел. 0555 32 50 72 и офис 0312 48 64 91 (в любое время суток) Яна.
              Адрес: Московская д.39 кв.5 (между Правдой и Гоголя)
              Цитата(Амурка @ 1.11.2010, 17:11) *
              Это наши банковские реквизиты.

              Bank account in the Kyrgyz Republic
              Demir Kyrgyz International Bank
              Chui Avenue 245
              720001 Bishkek
              Kyrgyz Republic

              ”Babushka Adoption”
              Account: 1181000300048642
              SWIFT: DEMIKG22


              Список необходимых лекарств:

              Алахол
              Амбросан
              Аминалон
              Валокордин
              Винпоцетин
              Голдрэй
              Кавинтон
              Карвалол
              Кардикей
              Касторовое масло
              Корсил
              Коринфар Ретард
              Коринфар
              Крион
              Ксефокам
              Курантил
              Линкас
              Лимуан Тромбоз
              Маалокс
              Милдронат
              Остенил
              Репронат
              Санодоксин
              Сермион
              Триампур
              Фурацемид
              Хелак Форте
              Цинепар Актив
              Эсенциале Форте
              Эднит


              Это лишь некоторые, список постепенно будет пополняться ',
      post_category: post_categories.first,
      organization: user_organizations[4].organization,
      user: user_organizations[4].user
    },
    {
      title: 'Давайте поможем Дому Малютки!',
      body: 'Скоро 1 июня и многие захотят оказать помощь детям. Мы с подругами побывали в Доме малютке на Белорусской 121, отвезли немного вещей (акт прилагается, выложу утром). Администрация передала список нужд детей, просили помочь по этому списку. Если кто-нибудь может поехать к ним и что-то передать, просьба при передаче вещей просить акт приема комиссией и по возможности приехать к ним еще разок через месяцок в гости к детям и глянуть, ходят ли дети в ваших футболках, проводятся ли занятия и игры с вашими игрушками и т.д. Помогать - это хорошо, но и проверять, по назначению ли пошла помощь, не грех! Заранее спасибо откликнувшимся! ',
      post_category: post_categories.first,
      organization: user_organizations[0].organization,
      user: user_organizations[0].user
    }

]

posts_data.each do |post|
  Post.create!({
    title: post[:title],
    body: post[:body],
    post_category: post[:post_category],
    organization: post[:organization],
    user: post[:user]
  })
end

# Post.create!({
#     title: posts_data[0][:title],
#     body: posts_data[0][:body],
#     post_category: post_categories.first,
#     organization: user_organizations.first.organization,
#     user: user_organizations.first.user
# })
#
# 20.times do
#   org = user_organizations[rand(0...user_organizations.size)]
#   Post.create!([
#       {
#           title: FFaker::Lorem.sentence(word_count=5),
#           body: FFaker::Lorem.paragraph,
#           post_category: post_categories[rand(0...post_categories.size)],
#           organization: org.organization,
#           user: org.user
#       }
#   ])
# end

posts = Post.all

50.times do
  PostComment.create!([
    {
      body: FFaker::Lorem.paragraph,
      post: posts[rand(0...posts.size)],
      user: users[rand(0...users.size)]
    }
  ])
end

aid_posts = Post.all.where(post_category_id: 1)

20.times do
  Aid.create!([
    {
       description: FFaker::Lorem.paragraph,
       post: aid_posts[rand(0...aid_posts.size)],
       user: users[rand(0...users.size)],
       organization: organizations.first,
       status: rand(0..2)
    }
  ])
end




